{
    "scholarshipData": [
        {
            "id": "01",
            "title": "Coal City University (CCU) 2024 Annual Essay Contest for Nigerian Students",
            "info": "Coal City University Chancellors’ annual essay contest is organized to encourage students develop their writing skills, build confidence, and showcase their creativity.",
            "link": "https://ccu.edu.ng/index.php/2024-essay-competition/"
        },
        {
            "id": "02",
            "title": "NWAG Scholarship Program for Nigerian Students 2024",
            "info": "The Nigerian Women Association of Georgia, Inc. (NWAG), based in the USA, is committed to promoting education among Nigerian students.",
            "link": "https://nwag.org/nigeria-scholarship.php"
        },
        {
            "id": "03",
            "title": "Wilson and Yinka Badejo Foundation 2024 Nurturing Hearts Scholarship For Young Undergraduate Nigerian Students",
            "info": "The Nurturing Hearts scholarship is a new scholarship category launched this year in honour of our co-founder; Rev. Mrs. Adeyinka Badejo.",
            "link": "https://form.jotform.com/240740366738562"
        },
        {
            "id": "04",
            "title": "NNPC/Seplat JV National Undergraduate Scholarship 2024 For Nigerian Students",
            "info": "The NNPC/Seplat JV National Undergraduate Scholarship is a laudable initiative jointly undertaken by the Nigerian National Petroleum Commission (NNPC) and Seplat Petroleum Distribution Company. ",
            "link": "https://www.seplatenergy.com/news-insights/news/nnpc-seplat-jv-national-undergraduate-scholarship-2024/"
        },
        {
            "id": "05",
            "title": "Ojah Scholarship Foundation (OSF) Annual Undergraduate Scholarship For Nigerian Students 2024",
            "info": "The OSF Annual Scholarship is now OPEN for application. To confirm your qualification for the scholarship, we advise that you carefully read the below information on eligibility, how to apply and the scholarship grant. ",
            "link": "https://www.ojascholarships.org/application"
        },
        {
            "id": "06",
            "title": "Selar's Tuition Fund For Nigerian Undergraduate Students 2024",
            "info": "Through the Tuition Support Project, Selar aims to offer financial aid by subsidising tuition fees for 50 final year students in any Tertiary Institution in Nigeria.",
            "link": "https://events.selar.co/page/schoolfund"
        },
        {
            "id": "07",
            "title": "MUTA Education Scholarship for Nigerian Students 2024",
            "info": "The MUTA Education is pleased to announce a call for applications for the 2024 MUTA Education Scholarship Program.",
            "link": "https://muta.org/apply-1#:~:text=The%20Committee%20expects%20to%20grant,directly%20related%20to%20undergraduate%20study"
        },
        {
            "id": "08",
            "title": "Nigeria Higher Education Foundation (NHEF) Scholarship Program for Nigerian Students 2024",
            "info": "Application for the 2024 Nigeria Higher Education Foundation (NHEF) Scholars Program is now open! Each year, the NHEF identifies talented young Nigerians from our various Partner Universities who have demonstrated strong academic excellence",
            "link": "https://portal.thenhef.org/"
        },
        {
            "id": "09",
            "title": "Agbami Scholarship for 100 and 200 Level Undergraduate Nigeria Students",
            "info": "Star Deep Water Petroleum Limited, a Chevron company and operator of the Agbami Field, in its continuous support for capacity building in the health and Engineering sectors as a strategic feed into the national manpower pool, offers a number of University Scholarship Awards to qualified Nigerian students of ALL the states of the Federation.",
            "link": ""
        }
    ]
}